import 'package:test_video_player/api/model/model_video.dart';

class MockVideoApi {
  Future<ModelVideo> fetchVideo() async {
    await Future.delayed(const Duration(seconds: 1));
    return tractor;
  }
}

final ModelVideo tractor = ModelVideo(
  title: 'Игра престолов: 3 сезон 7 серия',
  description:
      '''Группа одичалых перебирается через Сетну и продолжают движение на юг. Игритт, никогда не бывавшая по ту сторону Стены, не прекращает удивляться увиденному здесь.
Леди Маргери утешает Сансу, которая не хочет выходить замуж за Тириона.
Дейенерис подходит к городу Юнкай, где по слухам держатся в рабстве 200000 человек. Она намеревается освободить рабов. Посланник из Юнкая приходит к Дейенерис, чтобы договориться. Он предлагает ей несметные богатства и корабли, но взамен она должна не нападать на Юнкай. Дейенерис отказывается от этого предложения.
Джейме Ланнистер отправляется в Королевскую Гавань. Но до своего отбытия он отправляется навестить Бриенну, которую держат в темнице. По пути в столицу он начинает шантажировать главаря группы, заставив всю группу вернуться в Харренхол. Джейме намеревается спасти Бриенну и поспевает вовремя, ведь её бросили на арену к дикому медведю.''',
  url:
      'https://cdn.videozcdn.uk/video/thrones-new/sez-3-lostfilm/07.mp4/master.m3u8',
);
